barsgl/barsgl-ejbparent/barsgl-ejbtest/src/test/resources/AccountDetailsOpenFcc.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gbo="urn:ucbru:gbo:v5"
                  xmlns:acc="urn:ucbru:gbo:v5:acc">
    <soapenv:Header>
        <NS1:UCBRUHeaders xmlns:NS1="urn:ucbru:gbo:v5">
            <NS1:Audit>
                <NS1:MessagePath>
                    <NS1:Step>
                        <NS1:Application.Module>SACC.v5.AcDeNo.NotificationHandler</NS1:Application.Module>
                        <NS1:VersionId>v5</NS1:VersionId>
                        <NS1:TimeStamp>2017-11-09T13:58:02.662+03:00</NS1:TimeStamp>
                        <NS1:RoutingRole>START</NS1:RoutingRole>
                        <NS1:Comment>Start of message processing</NS1:Comment>
                    </NS1:Step>
                    <NS1:Step>
                        <NS1:Application.Module>SACC.AccountListQuery.RequestHandler</NS1:Application.Module>
                        <NS1:VersionId>v5</NS1:VersionId>
                        <NS1:TimeStamp>2017-11-09T13:58:02.668+03:00</NS1:TimeStamp>
                        <NS1:RoutingRole>START</NS1:RoutingRole>
                        <NS1:Comment>Start of message processing</NS1:Comment>
                    </NS1:Step>
                    <NS1:Step>
                        <NS1:Application.Module>SACC.MasterAccountPositioningBatchQuery.RequestHandler
                        </NS1:Application.Module>
                        <NS1:VersionId>v5</NS1:VersionId>
                        <NS1:TimeStamp>2017-11-09T13:58:02.672+03:00</NS1:TimeStamp>
                        <NS1:RoutingRole>START</NS1:RoutingRole>
                        <NS1:Comment>Start of message processing</NS1:Comment>
                    </NS1:Step>
                    <NS1:Step>
                        <NS1:Application.Module>SACC.MasterAccountPositioningBatchQuery.RequestHandler
                        </NS1:Application.Module>
                        <NS1:VersionId>v5</NS1:VersionId>
                        <NS1:TimeStamp>2017-11-09T13:58:02.703+03:00</NS1:TimeStamp>
                        <NS1:RoutingRole>ROUTE</NS1:RoutingRole>
                        <NS1:Comment>In the cache of the accounts not detected, will be requested ABS</NS1:Comment>
                    </NS1:Step>
                    <NS1:Step>
                        <NS1:Application.Module>SACC.MasterAccountPositioningBatchQuery.ABSRequestHandler
                        </NS1:Application.Module>
                        <NS1:VersionId>v5</NS1:VersionId>
                        <NS1:TimeStamp>2017-11-09T13:58:02.711+03:00</NS1:TimeStamp>
                        <NS1:RoutingRole>START</NS1:RoutingRole>
                        <NS1:Comment>Start of message processing</NS1:Comment>
                    </NS1:Step>
                    <NS1:Step>
                        <NS1:Application.Module>SACC.MasterAccountPositioningBatchQuery.ABSRequestHandler
                        </NS1:Application.Module>
                        <NS1:VersionId>v5</NS1:VersionId>
                        <NS1:TimeStamp>2017-11-09T13:58:02.715+03:00</NS1:TimeStamp>
                        <NS1:RoutingRole>ROUTE</NS1:RoutingRole>
                        <NS1:Comment>Routing by cache settings</NS1:Comment>
                    </NS1:Step>
                    <NS1:Step>
                        <NS1:Application.Module>SACC.MasterAccountPositioningBatchQuery.ABSResponseHandler
                        </NS1:Application.Module>
                        <NS1:VersionId>v5</NS1:VersionId>
                        <NS1:TimeStamp>2017-11-09T13:58:02.765+03:00</NS1:TimeStamp>
                        <NS1:RoutingRole>ROUTE SUCCESS</NS1:RoutingRole>
                        <NS1:Comment>The responses received from ECHO,FCC</NS1:Comment>
                    </NS1:Step>
                    <NS1:Step>
                        <NS1:Application.Module>SACC.MasterAccountPositioningBatchQuery.ABSResponseHandler
                        </NS1:Application.Module>
                        <NS1:VersionId>v5</NS1:VersionId>
                        <NS1:TimeStamp>2017-11-09T13:58:02.767+03:00</NS1:TimeStamp>
                        <NS1:RoutingRole>SUCCESS</NS1:RoutingRole>
                        <NS1:Comment>Finish of message processing</NS1:Comment>
                    </NS1:Step>
                    <NS1:Step>
                        <NS1:Application.Module>SACC.MasterAccountPositioningBatchQuery.ResponseHandler
                        </NS1:Application.Module>
                        <NS1:VersionId>v5</NS1:VersionId>
                        <NS1:TimeStamp>2017-11-09T13:58:02.772+03:00</NS1:TimeStamp>
                        <NS1:RoutingRole>SUCCESS</NS1:RoutingRole>
                        <NS1:Comment>Finish of message processing</NS1:Comment>
                    </NS1:Step>
                    <NS1:Step>
                        <NS1:Application.Module>SACC.AccountListQuery.ABSRouter</NS1:Application.Module>
                        <NS1:VersionId>v5</NS1:VersionId>
                        <NS1:TimeStamp>2017-11-09T13:58:02.777+03:00</NS1:TimeStamp>
                        <NS1:RoutingRole>ROUTE</NS1:RoutingRole>
                        <NS1:Comment>Routing by cache settings</NS1:Comment>
                    </NS1:Step>
                    <NS1:Step>
                        <NS1:Application.Module>SACC.AccountListQuery.ResponseHandler</NS1:Application.Module>
                        <NS1:VersionId>5</NS1:VersionId>
                        <NS1:TimeStamp>2017-11-09T13:58:02.906+03:00</NS1:TimeStamp>
                        <NS1:RoutingRole>ROUTE SUCCESS</NS1:RoutingRole>
                        <NS1:Comment>The responses received from ECHO,FCC</NS1:Comment>
                    </NS1:Step>
                    <NS1:Step>
                        <NS1:Application.Module>SACC.AccountListQuery.ResponseHandler</NS1:Application.Module>
                        <NS1:VersionId>v5</NS1:VersionId>
                        <NS1:TimeStamp>2017-11-09T13:58:02.908+03:00</NS1:TimeStamp>
                        <NS1:RoutingRole>SUCCESS</NS1:RoutingRole>
                        <NS1:Comment>Finish of message processing</NS1:Comment>
                    </NS1:Step>
                    <NS1:Step>
                        <NS1:Application.Module>SACC.v5.AcDeNo.PublishHandler</NS1:Application.Module>
                        <NS1:VersionId>v5</NS1:VersionId>
                        <NS1:TimeStamp>2017-11-09T13:58:02.914+03:00</NS1:TimeStamp>
                        <NS1:RoutingRole>SUCCESS</NS1:RoutingRole>
                        <NS1:Comment>Finish of message processing</NS1:Comment>
                    </NS1:Step>
                </NS1:MessagePath>
            </NS1:Audit>
        </NS1:UCBRUHeaders>
    </soapenv:Header>
    <soapenv:Body>
        <acc:AccountList>
            <acc:AccountDetails>
                <acc:AccountNo>02544977RURPRDC101</acc:AccountNo>
                <acc:Branch>C02</acc:Branch>
                <acc:CBAccountNo>40817810150150065957</acc:CBAccountNo>
                <acc:Ccy>RUR</acc:Ccy>
                <acc:CcyDigital>810</acc:CcyDigital>
                <acc:Description>PRDC1 50 KKI</acc:Description>
                <acc:Status>O</acc:Status>
                <acc:CustomerNo>02544977</acc:CustomerNo>
                <acc:Special>PRDC1</acc:Special>
                <acc:OpenDate>2017-11-09</acc:OpenDate>
                <acc:AltAccountNo>02544977RURPRDC101</acc:AltAccountNo>
                <acc:Type>S</acc:Type>
                <acc:ATMAvailable>N</acc:ATMAvailable>
                <acc:IsFrozen>N</acc:IsFrozen>
                <acc:IsDormant>N</acc:IsDormant>
                <acc:CreditTransAllowed>Y</acc:CreditTransAllowed>
                <acc:DebitTransAllowed>Y</acc:DebitTransAllowed>
                <acc:ClearingBank>046015081</acc:ClearingBank>
                <acc:CorBank>046015081</acc:CorBank>
                <acc:Positioning>
                    <acc:CBAccount>40817810150150065957</acc:CBAccount>
                    <acc:IMBAccountNo>40817810150150065957</acc:IMBAccountNo>
                    <acc:IMBBranch>C02</acc:IMBBranch>
                    <acc:HostABSAccountNo>02544977RURPRDC101</acc:HostABSAccountNo>
                    <acc:HostABSBranch>C02</acc:HostABSBranch>
                    <acc:HostABS>FCC</acc:HostABS>
                </acc:Positioning>
                <acc:MIS>
                    <acc:Group>R_P_MC</acc:Group>
                    <acc:Pool>DFLTPOOL</acc:Pool>
                    <acc:GroupComponent>R_P_MC</acc:GroupComponent>
                    <acc:TransactionClass>
                        <acc:Name>TXNMIS1</acc:Name>
                    </acc:TransactionClass>
                    <acc:TransactionClass>
                        <acc:Name>TXNMIS2</acc:Name>
                    </acc:TransactionClass>
                    <acc:TransactionClass>
                        <acc:Name>TXNMIS3</acc:Name>
                    </acc:TransactionClass>
                    <acc:TransactionClass>
                        <acc:Name>TXNMIS4</acc:Name>
                    </acc:TransactionClass>
                    <acc:TransactionClass>
                        <acc:Name>TXNMIS5</acc:Name>
                    </acc:TransactionClass>
                    <acc:TransactionClass>
                        <acc:Name>TXNMIS6</acc:Name>
                    </acc:TransactionClass>
                    <acc:TransactionClass>
                        <acc:Name>TXNMIS7</acc:Name>
                    </acc:TransactionClass>
                    <acc:TransactionClass>
                        <acc:Name>TXNMIS8</acc:Name>
                    </acc:TransactionClass>
                    <acc:TransactionClass>
                        <acc:Name>TXNMIS9</acc:Name>
                    </acc:TransactionClass>
                    <acc:TransactionClass>
                        <acc:Name>TXNMIS10</acc:Name>
                    </acc:TransactionClass>
                    <acc:CompositeClass>
                        <acc:Name>COMPMIS1</acc:Name>
                    </acc:CompositeClass>
                    <acc:CompositeClass>
                        <acc:Name>COMPMIS2</acc:Name>
                    </acc:CompositeClass>
                    <acc:CompositeClass>
                        <acc:Name>COMPMIS3</acc:Name>
                    </acc:CompositeClass>
                    <acc:CompositeClass>
                        <acc:Name>COMPMIS4</acc:Name>
                    </acc:CompositeClass>
                    <acc:CompositeClass>
                        <acc:Name>COMPMIS5</acc:Name>
                    </acc:CompositeClass>
                    <acc:CompositeClass>
                        <acc:Name>COMPMIS6</acc:Name>
                    </acc:CompositeClass>
                    <acc:CompositeClass>
                        <acc:Name>COMPMIS7</acc:Name>
                    </acc:CompositeClass>
                    <acc:CompositeClass>
                        <acc:Name>COMPMIS8</acc:Name>
                    </acc:CompositeClass>
                    <acc:CompositeClass>
                        <acc:Name>COMPMIS9</acc:Name>
                    </acc:CompositeClass>
                    <acc:CompositeClass>
                        <acc:Name>COMPMIS10</acc:Name>
                    </acc:CompositeClass>
                    <acc:CostCode>
                        <acc:Name>COSTCOD1</acc:Name>
                    </acc:CostCode>
                    <acc:CostCode>
                        <acc:Name>COSTCOD2</acc:Name>
                    </acc:CostCode>
                    <acc:CostCode>
                        <acc:Name>COSTCOD3</acc:Name>
                    </acc:CostCode>
                    <acc:CostCode>
                        <acc:Name>COSTCOD4</acc:Name>
                    </acc:CostCode>
                    <acc:CostCode>
                        <acc:Name>COSTCOD5</acc:Name>
                    </acc:CostCode>
                </acc:MIS>
                <acc:OpenBalance>0.00</acc:OpenBalance>
                <acc:CurrentBalance>0.00</acc:CurrentBalance>
                <acc:GWSAccType>CURR</acc:GWSAccType>
                <acc:OperationTypeCodes>VIEW=0,DOMPAY=1,CUPADE=0,CUPACO=0,</acc:OperationTypeCodes>
            </acc:AccountDetails>
        </acc:AccountList>
    </soapenv:Body>
</soapenv:Envelope>